package com.rison.szt.spark

import org.apache.spark.SparkConf
import org.apache.spark.internal.Logging
import org.apache.spark.sql.SparkSession
import org.apache.spark.sql.functions._


/**
 * @PACKAGE_NAME: com.rison.szt.spark
 * @NAME: JsonFile2Iceberg
 * @USER: Rison
 * @DATE: 2022/5/5 12:20
 * @PROJECT_NAME: iceberg-szt-traffic
 * */

object JsonFile2Iceberg extends Logging {
  def main(args: Array[String]): Unit = {
    val json_path = "hdfs:///rison/ods/szt-data.json"
    val sparkConf = new SparkConf()
            .set("spark.sql.adaptive.enabled", "true")
            .set("spark.sql.catalog.local", "org.apache.iceberg.spark.SparkCatalog")
            .set("spark.sql.catalog.local.type", "hadoop")
            .set("spark.sql.catalog.local.warehouse", "hdfs:///apps/hive/warehouse")
            .set("spark.sql.catalog.spark_catalog", "org.apache.iceberg.spark.SparkSessionCatalog")
            .set("spark.sql.catalog.spark_catalog.type", "hive")
            .set("spark.sql.catalog.spark_catalog.uri", "thrift://tbds-10-1-0-84:9083")
            .set("spark.sql.parquet.binaryAsString", "true")
            .set("spark.sql.session.timeZone", "CST")
            .set("spark.sql.warehouse.dir", "/apps/hive/warehouse")
            .set("spark.sql.catalog.catalog-name.default-namespace", "default")
            .set("spark.sql.sources.partitionOverwriteMode", "dynamic")
            .set("spark.sql.iceberg.handle-timestamp-without-timezone", "true")
//      .setMaster("local[*]")
      .setAppName("JsonFile2Iceberg")
    val sparkSession = SparkSession.builder().config(sparkConf).getOrCreate()
    import sparkSession.implicits._
    //初始化iceberg ods数据
    logInfo(s"==== jsonFile -> ods start... =====")
    sparkSession
      .read
      .json(json_path)
      .select(explode(col("data")).as("data"))
      .select("data.deal_date",
        "data.close_date",
        "data.card_no",
        "data.deal_value",
        "data.deal_type",
        "data.company_name",
        "data.car_no",
        "data.station",
        "data.conn_mark",
        "data.deal_money",
        "data.equ_no"
      )
      .withColumn("close_date", col("close_date").cast("timestamp"))
      .writeTo("spark_catalog.szt_db.ods_szt_data").overwritePartitions()
    logInfo(s"==== jsonFile -> ods finish ! =====")


    sparkSession.close()
  }
}
/**
/usr/hdp/2.2.0.0-2041/spark/bin/spark-submit  --class com.rison.szt.spark.JsonFile2Iceberg \
    --master yarn \
    --deploy-mode cluster \
    --driver-memory 500m \
    --executor-memory 500m \
    --executor-cores 1 \
    --queue default \
    /root/spark-dir/szt-spark.jar
 **/


/**
spark-sql> select * from szt_db.ods_szt_data limit 100;

2018-08-31 22:14:50	2018-09-01 00:00:00	CBEHFCFCG	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 22:13:39	2018-09-01 00:00:00	CBCEBDIJE	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 23:11:06	2018-09-01 00:00:00	FFHEDIBCC	700	地铁出站	地铁五号线	OGT-101	长龙	0	665	263031101
2018-08-31 23:08:15	2018-09-01 00:00:00	FFDGIGIFH	500	地铁出站	地铁五号线	OGT-101	长龙	0	475	263031101
2018-08-31 19:41:51	2018-09-01 00:00:00	FHDICIDBD	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-08-31 22:30:08	2018-09-01 00:00:00	FHEDCGCCA	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 23:12:04	2018-09-01 00:00:00	CCJIAAIFJ	400	地铁出站	地铁五号线	OGT-101	长龙	0	380	263031101
2018-08-31 22:45:05	2018-09-01 00:00:00	CBHHGEJEC	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 19:51:21	2018-09-01 00:00:00	HHAAJFHIE	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-09-01 04:47:20	2018-09-01 00:00:00	HHAAJAEGB	200	地铁出站	地铁三号线	AGM-104	双龙	0	0	261032104
2018-08-31 22:49:31	2018-09-01 00:00:00	FHIFJCJBE	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 22:51:22	2018-09-01 00:00:00	FFHCHFCFG	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 20:18:50	2018-09-01 00:00:00	CBEBEJJCI	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-08-31 22:49:56	2018-09-01 00:00:00	FFIADAEJD	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-09-01 04:41:05	2018-09-01 00:00:00	HHAAJIJJE	0	地铁入站	地铁三号线	AGM-102	荷坳	0	0	261026102
2018-08-31 22:48:00	2018-09-01 00:00:00	CBGJBBJHH	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 22:55:34	2018-09-01 00:00:00	BIJCHFBCA	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-09-01 04:52:00	2018-09-01 00:00:00	HHJJAFJCF	200	地铁出站	地铁九号线	OGT-102	红岭	0	0	267027102
2018-09-01 04:54:21	2018-09-01 00:00:00	HHAAJHEFF	200	地铁出站	地铁九号线	双AGM-117	红岭南	0	0	267028117
2018-08-31 20:36:56	2018-09-01 00:00:00	FFFJEIFFC	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-08-31 20:43:21	2018-09-01 00:00:00	FIJDJIFCH	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-09-01 05:10:13	2018-09-01 00:00:00	HHJJAIHJH	200	地铁出站	地铁一号线	OGT-107	世界之窗站	0	0	268016107
2018-09-01 05:10:05	2018-09-01 00:00:00	HHJJAIAHC	200	地铁出站	地铁十一号线	AGT-101	后亭	0	0	241026101
2018-09-01 05:11:47	2018-09-01 00:00:00	HHJJAEIGB	200	地铁出站	地铁十一号线	OGT-114	南山站	0	0	241015114
2018-09-01 05:11:29	2018-09-01 00:00:00	HHJJBJJID	200	地铁出站	地铁十一号线	OGT-105	塘尾站	0	0	241023105
2018-09-01 05:16:33	2018-09-01 00:00:00	HHAAJJIAB	0	地铁入站	地铁一号线	AGT-109	华强路站	0	0	268006109
2018-08-31 20:59:11	2018-09-01 00:00:00	FFIACBHFC	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-09-01 05:28:02	2018-09-01 00:00:00	HHAAJAGBE	200	地铁出站	地铁五号线	NULL	NULL	0	0	263020143
2018-08-31 21:08:11	2018-09-01 00:00:00	FFCBDHHDI	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-08-31 21:07:42	2018-09-01 00:00:00	BJGCEABJ	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-09-01 05:44:58	2018-09-01 00:00:00	HHAAJBCGJ	0	地铁入站	地铁七号线	进AGM15-16	福民	0	0	265025111
2018-09-01 05:11:56	2018-09-01 00:00:00	HHACJJGIH	200	地铁出站	地铁四号线	AGM-119	龙华	0	0	262012119
2018-09-01 06:00:32	2018-09-01 00:00:00	HHAAJJDCE	200	地铁出站	地铁二号线	OGT-101	登良	0	0	260018101
2018-09-01 05:57:58	2018-09-01 00:00:00	HHAAJHCEH	0	地铁入站	地铁十一号线	IGT-119	塘尾站	0	0	241023119
2018-09-01 06:00:33	2018-09-01 00:00:00	HHAAJACBE	200	地铁出站	地铁十一号线	AGT-118	宝安站	0	0	241017118
2018-09-01 06:01:21	2018-09-01 00:00:00	HHJJBIJFD	0	地铁入站	地铁二号线	OGT-114	景田	0	0	260029114
2018-09-01 05:31:52	2018-09-01 00:00:00	HHACJAJDI	0	地铁入站	地铁四号线	AGM-103	红山	0	0	262015103
2018-09-01 05:34:44	2018-09-01 00:00:00	HHACJAJDI	200	地铁出站	地铁四号线	AGM-115	红山	0	0	262015115
2018-09-01 05:45:16	2018-09-01 00:00:00	HHACJACAG	200	地铁出站	地铁四号线	AGM-113	龙华	0	0	262012113
2018-09-01 05:21:46	2018-09-01 00:00:00	HHACJACAG	0	地铁入站	地铁四号线	AGM-109	龙华	0	0	262012109
2018-09-01 05:49:08	2018-09-01 00:00:00	HHACJJEFA	0	地铁入站	地铁四号线	AGM-102	上塘	0	0	262014102
2018-09-01 05:37:02	2018-09-01 00:00:00	HHJAJJCGE	0	地铁入站	地铁四号线	AGM-113	上梅林	0	0	262019113
2018-09-01 05:50:10	2018-09-01 00:00:00	HHACJJEAC	0	地铁入站	地铁四号线	AGM-105	白石龙	0	0	262017105
2018-09-01 05:21:56	2018-09-01 00:00:00	HHJAJJGGH	200	地铁出站	地铁四号线	NULL	NULL	0	0	262019125
2018-09-01 05:51:34	2018-09-01 00:00:00	HHACJJEAC	200	地铁出站	地铁四号线	AGM-110	白石龙	0	0	262017110
2018-09-01 05:50:28	2018-09-01 00:00:00	HHACJJEFA	200	地铁出站	地铁四号线	AGM-108	上塘	0	0	262014108
2018-09-01 06:05:12	2018-09-01 00:00:00	HHJJAIADA	0	地铁入站	地铁一号线	IGT-103	大剧院站	0	0	268004103
2018-09-01 06:05:04	2018-09-01 00:00:00	HHAAACGAI	0	地铁入站	地铁一号线	AGT-120	岗厦站	0	0	268007120
2018-09-01 06:03:08	2018-09-01 00:00:00	HHJJAGDJH	0	地铁入站	地铁一号线	IGT-124	桃园	0	0	268025124
2018-09-01 06:01:16	2018-09-01 00:00:00	HHAAJAHHC	0	地铁入站	地铁九号线	IGT-112	?I岭	0	0	267022112
2018-09-01 06:03:10	2018-09-01 00:00:00	HHAAJFEJE	0	地铁入站	地铁九号线	双AGM-119	梅景	0	0	267018119
2018-09-01 06:03:14	2018-09-01 00:00:00	HHAAJHCEH	200	地铁出站	地铁十一号线	AGT-101	塘尾站	0	0	241023101
2018-09-01 06:06:10	2018-09-01 00:00:00	HHAAAAJEH	0	地铁入站	地铁十一号线	AGT-114	碧头	0	0	241028114
2018-08-31 22:11:40	2018-09-01 00:00:00	FHHJFFAGC	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 22:33:05	2018-09-01 00:00:00	FHFIGGDBG	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-09-01 04:34:45	2018-09-01 00:00:00	HHABJFJGJ	0	地铁入站	地铁一号线	AGM-107	深圳大学	0	0	268024107
2018-08-31 22:46:45	2018-09-01 00:00:00	BICJHDBJJ	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 22:46:25	2018-09-01 00:00:00	FIJHBJIFF	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 23:21:11	2018-09-01 00:00:00	CBHGEJBAE	700	地铁出站	地铁五号线	OGT-101	长龙	0	665	263031101
2018-08-31 19:54:31	2018-09-01 00:00:00	BIDHCBIFD	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-08-31 22:49:35	2018-09-01 00:00:00	BIDGICAEG	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 23:09:59	2018-09-01 00:00:00	FHHFJJJHC	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 22:48:13	2018-09-01 00:00:00	FIJGAJACB	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 22:47:51	2018-09-01 00:00:00	CCAEEBDCB	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 21:23:19	2018-09-01 00:00:00	CBGJHBCJD	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-09-01 05:36:22	2018-09-01 00:00:00	HHAAJFDDC	0	地铁入站	地铁七号线	进AGM33-34	赤尾	0	0	265028130
2018-08-31 21:33:00	2018-09-01 00:00:00	BIJIEBBJB	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-08-31 21:53:39	2018-09-01 00:00:00	FHCJABIJE	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-08-31 21:50:46	2018-09-01 00:00:00	CBDIAEJGF	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-09-01 05:39:10	2018-09-01 00:00:00	CFBAJECDH	800	巴士	金华南巴士	粤BU2313	332(观澜)	0	595	227000010
2018-09-01 05:44:20	2018-09-01 00:00:00	FFJIJIEJA	400	巴士	金华南巴士	粤BW2731	M433(福永）	0	315	227000161
2018-09-01 05:19:47	2018-09-01 00:00:00	CFAGIHDFG	200	巴士	金华南巴士	粤BW0461	M433(皇岗）	0	160	227000169
2018-09-01 05:45:52	2018-09-01 00:00:00	FHFJHIGGI	200	巴士	金华南巴士	粤BW0461	M433(皇岗）	0	160	227000169
2018-09-01 05:59:08	2018-09-01 00:00:00	CFAGJAJID	200	巴士	金华南巴士	粤BU2663	332(观澜)	0	160	227000215
2018-09-01 05:51:25	2018-09-01 00:00:00	FFGIDBAAF	500	巴士	金华南巴士	粤BW3116	E24	0	390	227000265
2018-09-01 05:47:33	2018-09-01 00:00:00	CBEJHHBBD	300	巴士	金华南巴士	粤BW7517	M433(福永）	0	240	227000283
2018-09-01 05:48:10	2018-09-01 00:00:00	FHIAAHGHB	200	巴士	华程交通	粤BBA343	深惠3B线	0	200	235000341
2018-09-01 05:34:09	2018-09-01 00:00:00	CFADHAEEC	400	巴士	华程交通	粤BK6982	深惠3A线	0	400	235000362
2018-09-01 05:41:57	2018-09-01 00:00:00	CBEBIHGID	400	巴士	华程交通	粤BJ9811	深惠3B线	0	400	235000444
2018-09-01 05:57:19	2018-09-01 00:00:00	HHAAJBEDD	0	地铁入站	地铁九号线	双AGM-119	梅村	0	0	267020119
2018-09-01 06:03:52	2018-09-01 00:00:00	HHAAJBCGF	0	地铁入站	地铁九号线	IGT-109	银湖	0	0	267023109
2018-09-01 06:05:03	2018-09-01 00:00:00	HHJJAEIGB	200	地铁出站	地铁十一号线	OGT-126	南山站	0	0	241015126
2018-09-01 06:02:48	2018-09-01 00:00:00	HHJJAEIGB	0	地铁入站	地铁十一号线	IGT-111	南山站	0	0	241015111
2018-09-01 06:05:26	2018-09-01 00:00:00	HHABAEGJG	0	地铁入站	地铁五号线	IGT-105	留仙洞	0	0	263019105
2018-09-01 04:29:14	2018-09-01 00:00:00	HHJJBADCF	0	地铁入站	地铁三号线	AGM-102	永湖	0	0	261025102
2018-09-01 04:38:02	2018-09-01 00:00:00	HHAAJIAAJ	0	地铁入站	地铁三号线	AGM-102	大芬	0	0	261020102
2018-08-31 22:42:26	2018-09-01 00:00:00	FHGEBJJHH	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 22:42:37	2018-09-01 00:00:00	BEBACHGFH	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-09-01 04:31:53	2018-09-01 00:00:00	HHJJJEBDC	0	地铁入站	地铁五号线	IGT-119	怡景	0	0	263036119
2018-08-31 22:46:22	2018-09-01 00:00:00	CCADGJGDJ	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 22:45:39	2018-09-01 00:00:00	BIDHDIBIE	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 19:55:06	2018-09-01 00:00:00	BIDCBBEGB	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-08-31 22:45:48	2018-09-01 00:00:00	CBHFGJBJF	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-09-01 04:52:47	2018-09-01 00:00:00	HHJJJADBB	200	地铁出站	地铁二号线	OGT-102	海月	0	0	260017102
2018-08-31 22:45:32	2018-09-01 00:00:00	CBFHJHAFB	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 23:01:16	2018-09-01 00:00:00	CFBABHHCC	0	地铁入站	地铁五号线	IGT-105	布吉	0	0	263032105
2018-08-31 20:26:56	2018-09-01 00:00:00	BIHIABBCH	0	地铁入站	地铁五号线	IGT-104	布吉	0	0	263032104
2018-09-01 04:44:50	2018-09-01 00:00:00	HHAAJHIFF	200	地铁出站	地铁九号线	双AGM-104	鹿丹村	0	0	267029104
2018-09-01 04:53:07	2018-09-01 00:00:00	HHJJAIGCH	200	地铁出站	地铁五号线	OGT-103	宝华	0	0	263013103
2018-09-01 04:14:12	2018-09-01 00:00:00	FFIJJJJJB	200	地铁出站	地铁四号线	AGM-116	龙华	0	190	262012116
Time taken: 0.366 seconds, Fetched 100 row(s)

 */
